In [1]:
import numpy as np

In [5]:
temp = np.random.randint(low = 20, high = 100, size = [20,])
name = np.random.choice(['Dhairya', 'Meena', 'Mani', 'Riya'], 20)

In [6]:
random = np.random.choice([1, 2, 3, 4, 5, 6], 20)

In [7]:
x = list(zip(temp, name, random))

In [9]:
import pandas as pd
df = pd.DataFrame(data = x, columns = ['temp', 'name', 'random'])

In [10]:
df

    temp     name  random
0     78     Riya       6
1     73    Meena       1
2     37    Meena       4
3     35    Meena       1
4     83     Mani       2
5     73     Mani       2
6     93  Dhairya       1
7     60  Dhairya       3
8     57     Riya       2
9     60     Riya       2
10    87    Meena       3
11    29    Meena       5
12    94     Mani       2
13    61    Meena       2
14    95     Riya       5
15    77     Riya       5
16    77  Dhairya       3
17    92     Riya       1
18    72    Meena       3
19    81  Dhairya       4

In [11]:
type(x)

list

In [12]:
type(df)

pandas.core.frame.DataFrame

In [14]:
df = pd.DataFrame({'temp' : temp, 'name' : name, 'random' : random})

In [15]:
df.head()

   temp   name  random
0    78   Riya       6
1    73  Meena       1
2    37  Meena       4
3    35  Meena       1
4    83   Mani       2

In [16]:
df.tail()

    temp     name  random
15    77     Riya       5
16    77  Dhairya       3
17    92     Riya       1
18    72    Meena       3
19    81  Dhairya       4

In [17]:
df.shape

(20, 3)

In [18]:
df.columns

Index(['temp', 'name', 'random'], dtype='object')

In [19]:
df.name

0        Riya
1       Meena
2       Meena
3       Meena
4        Mani
5        Mani
6     Dhairya
7     Dhairya
8        Riya
9        Riya
10      Meena
11      Meena
12       Mani
13      Meena
14       Riya
15       Riya
16    Dhairya
17       Riya
18      Meena
19    Dhairya
Name: name, dtype: object

In [20]:
df['name']

0        Riya
1       Meena
2       Meena
3       Meena
4        Mani
5        Mani
6     Dhairya
7     Dhairya
8        Riya
9        Riya
10      Meena
11      Meena
12       Mani
13      Meena
14       Riya
15       Riya
16    Dhairya
17       Riya
18      Meena
19    Dhairya
Name: name, dtype: object

In [21]:
df['temp']

0     78
1     73
2     37
3     35
4     83
5     73
6     93
7     60
8     57
9     60
10    87
11    29
12    94
13    61
14    95
15    77
16    77
17    92
18    72
19    81
Name: temp, dtype: int32

In [22]:
df['temp'].describe()

count    20.000000
mean     70.700000
std      19.751349
min      29.000000
25%      60.000000
50%      75.000000
75%      84.000000
max      95.000000
Name: temp, dtype: float64

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 3 columns):
temp      20 non-null int32
name      20 non-null object
random    20 non-null int32
dtypes: int32(2), object(1)
memory usage: 448.0+ bytes

In [24]:
df.values

array([[78, 'Riya', 6],
       [73, 'Meena', 1],
       [37, 'Meena', 4],
       [35, 'Meena', 1],
       [83, 'Mani', 2],
       [73, 'Mani', 2],
       [93, 'Dhairya', 1],
       [60, 'Dhairya', 3],
       [57, 'Riya', 2],
       [60, 'Riya', 2],
       [87, 'Meena', 3],
       [29, 'Meena', 5],
       [94, 'Mani', 2],
       [61, 'Meena', 2],
       [95, 'Riya', 5],
       [77, 'Riya', 5],
       [77, 'Dhairya', 3],
       [92, 'Riya', 1],
       [72, 'Meena', 3],
       [81, 'Dhairya', 4]], dtype=object)

In [25]:
df

    temp     name  random
0     78     Riya       6
1     73    Meena       1
2     37    Meena       4
3     35    Meena       1
4     83     Mani       2
5     73     Mani       2
6     93  Dhairya       1
7     60  Dhairya       3
8     57     Riya       2
9     60     Riya       2
10    87    Meena       3
11    29    Meena       5
12    94     Mani       2
13    61    Meena       2
14    95     Riya       5
15    77     Riya       5
16    77  Dhairya       3
17    92     Riya       1
18    72    Meena       3
19    81  Dhairya       4